app/views/videos/index.html.haml

      %strong= category.name
    -category.videos.each do |video|
---
SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = 1