app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
SELECT "categories".* FROM "categories"
---
  def index
    @videos = Video.all
    @categories = Category.all

SELECT  "videos".* FROM "videos"   ORDER BY "videos"."id" ASC LIMIT 1
---
  def show
    @video = Video.first