app/views/categories/show.html.haml

  %hr
  -@category.videos.each do |video|
---
SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = 1